/*Зад.1 Задание: Басейн с обем V има две тръби от които се пълни. Всяка тръба има определен дебит 
(литрите вода минаващи през една тръба за един час). Работникът пуска тръбите едновременно и излиза за N часа. 
Напишете програма, която изкарва състоянието на басейна, в момента, когато работникът се върне. 
Вход
От конзолата се четат четири реда:
•	Първият ред съдържа числото V – Обем на басейна в литри – цяло число в интервала [1…10000].
•	Вторият ред съдържа числото P1 – дебит на първата тръба за час – цяло число в интервала [1…5000].
•	Третият ред съдържа числото P2 – дебит на втората тръба за час– цяло число в интервала [1…5000].
•	Четвъртият ред съдържа числото H – часовете които работникът отсъства – реално число в интервала [1.0…24.00]
Изход
Да се отпечата на конзолата едно от двете възможни състояния:
•	До колко се е запълнил басейна и коя тръба с колко процента е допринесла.
o	"The pool is {запълненост на басейна в проценти}% full. Pipe 1: {процент вода от първата тръба}%. Pipe 2: 
{процент вода от втората тръба}%."
Aко басейнът се е препълнил – с колко литра е прелял за даденото време.
o	"For {часовете, които тръбите са пълнили вода} hours the pool overflows with {литрите вода в повече} liters."
*/ // вход: 1000 100 120 3


function vinkeloBaseino (input){
    let obemV = Number(input[0]); // обем на басейна в литри
    let debitPipe1 = Number(input[1]); // дебит/час за първата тръба в литри
    let debitPipe2 = Number(input[2]); // дебит/час за 2рата тръба в литри
    let hoursWorker = Number(input[3]); // времето за което отсъства работника
    const rabotaP1 = debitPipe1 * hoursWorker; // колко литра е запълнила първата траба за даденото време
    const rabotaP2 = debitPipe2 * hoursWorker; // колко литра е запълнила 2рата тръба за даденото време
    const combinedP = rabotaP1 + rabotaP2; // обща работа на 2те тръби извършена за даденото време в литри
    const percentWorkPipes = (combinedP * 100) / obemV; // колко процента е запълнен басейна общо от 2те тръби;
    const pipe1percent = (rabotaP1 * 100) / combinedP; // колко процента е запълнила 1вата тръба от извършената работа
    const pipe2percent = (rabotaP2 * 100) / combinedP; // колко процента е запълнила 2рата тръба от извършената работа(не от целия обем)
     if (combinedP > obemV){
            let prelivane = combinedP - obemV; 
            console.log(`For ${hoursWorker.toFixed(2)} hours the pool overflows with ${prelivane.toFixed(2)} liters.`)
        } else{
            console.log(
                `The pool is ${percentWorkPipes.toFixed(2)}% full. Pipe 1: ${pipe1percent.toFixed(2)}%. Pipe 2: ${pipe2percent.toFixed(2)}%.`);
        }
} 
vinkeloBaseino(["1000" , "100" , "120" , "3"]); 
// 100/100 wee 1st try xddd