function zadara(){ // нова функция с име "zadara"
    //console.log("Merhaba");  
    let text = "Hello"; 
    console.log(`${text.length}`)
     // отпечатваме съобщение в конзолата/екрана 
//това което очакваме да се отпечата като текст трябва да е в кавички 
// ако не е в кавички може например да отпечатаме резултат от декларирана константа или променлива 
// накрая на реда трябва да има точка и запетая
} 
zadara(); // команда за извикване на функцията, за да тръгне порграмата
// натискаме контрол и f5 и програмата работи 
// деклариране на променлива: със комадандата "let" и след това името на променливата
// например let a = 5;  
//променливите константите могат да бъдат от различен тип 
// като напримерн "Number" - числа ; "String" - низ/текст и "Undefined" - недефинирани; 
//