// Както от даден текст можем да проечетем само една буква 
// така и от един масив можем да прочетем даден елемент 
function masivi (input){ // в скобите се слага input ако очакваме да изведе 
    // някакъв потрбителски вход който се слага накрая когато изивкваме функцията 

    console.log(input[0]); // ще изведе първия елемент от масива а
    console.log(input[1]); // ще изведе втория елемент от масива b
    console.log(input[2]); // и третия елемент от масива c
} 
masivi (["a " , "b " , "c "]); // извикваме функцията masivi със предварително зададен вход от брой елементи 

