/*Задание: Напишете програма, която изчислява каква сума ще получите в края на депозитния 
период при определен лихвен процент. Използвайте следната формула: 
сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
Вход
От конзолата се четат 3 реда:
1.	Депозирана сума – реално число в интервала [100.00 … 10000.00]
2.	Срок на депозита (в месеци) – цяло число в интервала [1…12]
3.	Годишен лихвен процент – реално число в интервала [0.00 …100.00]
Изход
Да се отпечата на конзолата сумата в края на срока.
*/ 
// Потребителски вход: ["200 ","3 ","5.7 "] 
function depositCalculator(input){
    let depoziranaSuma = Number(input[0]); // променлива да чете депозираната сума 
    let srokNaDepozita = Number(input[1]); // променилва да чете срока на депозита в месеци
    let godishenLihven = Number(input[2]); // променлива да чете годишния лигвен процент 
    const procentLihva = godishenLihven/100; // константа да пробразува процента в десетично число
    const totalSum = depoziranaSuma + srokNaDepozita*((depoziranaSuma * procentLihva)/12); // изчисляваме крайната цена по формулата 
    console.log(totalSum); // принтираме орговора

} 
depositCalculator(["200" , "3" , "5.7"]); 
// ии мноу ясно 100/100 ко ши каиш
