/*Задание Напишете програма, която чете от конзолата три числа b1, b2 и h и пресмята 
лицето на трапец с основи b1 и b2 и височина h. Формулата за лице на трапец е (b1 + b2) * h / 2.
На фигурата по-долу е показан трапец със страни 8 и 13 и височина 7. Той има лице (8 + 13) * 7 / 2 = 73.5.
Отговорът трябва да е форматиран до втората цифра след десетичния знак.
*/ 
// вход 13 8  7
function liceTrapec(input){
    let b1 = Number(input[0]); // голяма основа 
    let b2 = Number(input[1]); // малка основа 
    let h1 = Number(input[2]); // височкина 
    // формула за пресмятане лицето н трапец: S=(b1+b2)*h/2 
    const lice = (b1+b2)*h1/2; 
    const decimal = parseFloat (lice).toFixed(2) // с тази команда се отпечатва резултата в десетична дроб, до 2рия знак
    console.log(decimal); 

} 
liceTrapec(["13" , "8" , "7"]); 
// ама и трябва да се форматира да го показва резултата до втория десетичен знак