/*Задание: Напишете програма, която чете от конзолата страна и височина на триъгълник 
и пресмята неговото лице. Използвайте формулата за лице на триъгълник: area = a * h / 2. 
Форматирате изхода до втория знак след десетичната запетая. */
// вход: 20 30 - страна и височкина
function liceTriagalnik(input){
    let strana = Number(input[0]); // променлива да чете страната
    let visochina = Number(input[1]); // променлива да чете височината
    const lice=strana*visochina/2; // формула да пресмята лицето - страна*височкина/2
    const decimalResult= parseFloat (lice).toFixed(2); // превръща отговора в десетична дроб до 2рия знак
    console.log(decimalResult); // отпечатва резултата

   
}
liceTriagalnik(["20" , "30"]); 
