/*Задание: Георги ще има гости вечерта и решава да ги нагости с паламуд, сафрид и миди Сен-Жак. 
Затова отива на рибната борса, за да си купи по няколко килограма. Oт конзолата се въвеждат 
цените в лева на скумрията и цацата. Също количеството на паламуд, сафрид и миди в килограми. 
Колко пари ще са му необходими, за да плати сметката си, ако цените на борсата са:
•	Паламуд – 60% по-скъп от скумрията
•	Сафрид – 80% по-скъп от цацата
•	Миди – 7.50 лв. за килограм
Вход
От конзолата се четат 5 числа:
•	Първи ред – цена на скумрията на килограм. Реално число в интервала [0.00…40.00]
•	Втори ред – цена на цацата на килограм. Реално число в интервала [0.00…30.00]
•	Трети ред – килограма паламуд. Реално число в интервала [0.00…50.00]
•	Четвърти ред – килограма сафрид. Реално число в интервала [0.00… 70.00]
•	Пети ред – килограма миди. Цяло число в интервала [0 ... 100]
Изход
Да се отпечата на конзолата едно число с плаваща запетая: колко пари ще са нужни на Георги, 
за да си плати сметката. Числото трябва да е форматирано до вторият знак след десетичната 
запетая (1.2457 -> 1.25).
*/ // вход: 6.90 4.20 1.5 2.5 1 
function ilovecsamIribarsam(input){
    let cenaSkumriqKg = Number(input[0]); 
    let cenaCacaKg = Number(input[1]); 
    let kgPalamud = Number(input[2]); 
    let kgSafrid = Number(input[3]); 
    let kgMidi = Number(input[4]); 
    const cenaPalamud = cenaSkumriqKg * 0.6 + cenaSkumriqKg; 
    const cenaSafrid = cenaCacaKg * 0.8 + cenaCacaKg ;
    const cenaMidikg = 7.50 * kgMidi; // той си купува само паламуд сафрид и миди
    const smetka = cenaPalamud*kgPalamud + cenaSafrid*kgSafrid + cenaMidikg; 
    console.log(parseFloat(smetka).toFixed(2)); 
} 
ilovecsamIribarsam(["6.90" , "4.20" , "1.50" , "2.50" , "1"])
