/** Задание: Градинар продавал реколтата от градината си на зеленчуковата борса. 
 * Продава зеленчуци за N лева на килограм и плодове за M лева за килограм. Напишете 
 * програма, която да пресмята приходите от реколтата в евро ( ако приемем, че едно евро е равно на 1.94лв).
Вход
От конзолата се четат 4 числа, по едно на ред:
•	Първи ред – Цена за килограм зеленчуци – реално число[0.00… 1000.00]
•	Втори ред – Цена за килограм плодове – реално число[0.00… 1000.00]
•	Трети ред – Общо килограми на зеленчуците – цяло число[0… 1000]
•	Четвърти ред – Общо килограми на плодовете – цяло число[0… 1000]
Изход
Да се отпечата на конзолата едно число: приходите от всички плодове и зеленчуци в евро.
Резултата да се форматира до втория знак след десетичния разделител.
 */ 
// вход: 0.194 19.4 10 10 
// 1 euro = 1.94 lv
function zeleBorsa(input){
    let cenaKgZelenchuci = Number(input[0]); // цена за кг зеленчуци 
    let cenaKgPlodove = Number(input[1]); // цена за кг плодове
    let totalKgZelenchuci = Number(input[2]); // общо кг зеленчуци
    let totalKgPlodove = Number(input[3]); // общо кг плодове 
    // смятаме крайната цена и делим на 1.94 за да превърнем резултата от лева в Евро
    const finalPrice = (cenaKgZelenchuci*totalKgZelenchuci + cenaKgPlodove*totalKgPlodove)/1.94; 
    const decimalPrice = parseFloat(finalPrice).toFixed(2); // крайна цена в евро в десетична дроб
    console.log(`The final price is: ${decimalPrice} Euro.`); 
// тряа пробвам да разделя 2те стойности да пише 101 евро и 00 цента

} 
zeleBorsa(["0.194" , "19.4" , "10" , "10"]); 
// бива ама го обърках лв в евро хдд